{
    "title": "Murder in the Disorient",
    "description": "A research facility deep within the twisted trails of the Disorient—a forest infamous for confusing travelers—was meant to be a retreat for a few select minds to escape the modern world. But when the lead cartographer turned up dead, the map suddenly didn’t matter anymore. With the compass spinning and fog rolling in, the Detective must piece together this perplexing puzzle.",
    "personList": [
        {
            "name": "Blue",
            "description": "The melancholy musician had come to the Disorient to “find his inner harmony.” But it seems disharmony followed him instead. He claims he never left the observation deck.",
            "icon": "👱"
        },
        {
            "name": "Red",
            "description": "A former underground fighter-turned-survivalist, Red was in charge of trail clearing. He believes maps are for the weak—and that’s not even the most suspicious thing about him.",
            "icon": "🦮"
        },
        {
            "name": "Green",
            "description": "The hacker-turned-recluse was supposedly off-grid and out of trouble. She insists she only came to the Disorient to meditate and “cleanse the cache.” But that fork in her bag says otherwise.",
            "icon": "🤦"
        }
    ],
    "weaponList": [
        {
            "name": "Compass Dagger",
            "description": "A ceremonial blade with a built-in compass. Ironically useless for finding true north, but perfect for finding a ribcage.",
            "icon": "🧭"
        },
        {
            "name": "Hiking Pole",
            "description": "Supposed to assist in rough terrain. This one has blood on the handle and something sharp jammed into the rubber tip.",
            "icon": "🥾"
        },
        {
            "name": "Fork",
            "description": "That’s right. Again. Silver-plated, engraved with the initials G.H. Found oddly clean, but misplaced.",
            "icon": "🍴"
        }
    ],
    "locationList": [
        {
            "name": "Cartographer’s Cabin",
            "description": "Where the body was found—surrounded by scattered maps and torn pages. Blood on the blueprint.",
            "icon": "🧭"
        },
        {
            "name": "Mirror Clearing",
            "description": "A strange grove where reflections echo at odd angles. Easy to lose your way—or your mind.",
            "icon": "🪞"
        },
        {
            "name": "Observation Deck",
            "description": "A high wooden platform above the tree line. Great for stargazing—or being alone with your thoughts… and your secrets.",
            "icon": "🔭"
        }
    ],
    "cluesList": [
        "The Compass Dagger was missing from its display case.",
        "A trail of muddy boot prints led away from the Mirror Clearing.",
        "Red has a limp that matches the walking pole’s missing cap.",
        "Green’s tent was set up near the Observation Deck, not the Mirror Clearing as she claimed.",
        "The victim was facing north when he died—suggesting he trusted whoever came from that direction."
    ],
    "hint": "In the Disorient, direction means nothing. But intention is everything.",
    "resolution": {
        "correctSolution": {
            "person": "Red",
            "location": "Mirror Clearing",
            "weapon": "Hiking Pole"
        },
        "resolutionText": "When confronted, Red stared at the Detective like a tree he might have to chop down. “You think I need a map to kill a man? He tried to ‘redesign’ the trails. Some paths aren’t meant to be paved.” He dropped the hiking pole and limped toward the trailhead, hands raised. The forest watched in silence."
    }
}